In [5]:
variable=0

In [6]:
print(variable)

0

In [7]:
type(variable)

int

In [1]:
print("Hello world")

Hello world

In [2]:
age=20
weight=50
weight1=50

In [ ]:
#membership operators is,is not, not in

In [ ]:
# string manupalation

In [52]:
 data_science='''Executive pg programme in data science from IIITB, India's leading institute.learners from our iiitb data science program have received an average salary hike of 58%.
NASSCOM certificate · IIIT-B Alumni Status · Exploratory Data Analysis'''

In [5]:
type(data_science)

str

In [57]:
data_science.capitalize()

"Executive pg programme in data science from iiitb, india's leading institute.learners from our iiitb data science program have received an average salary hike of 58%.\nnasscom certificate · iiit-b alumni status · exploratory data analysis"

In [25]:
len(data_science)

238

In [58]:
data_science.casefold()

"executive pg programme in data science from iiitb, india's leading institute.learners from our iiitb data science program have received an average salary hike of 58%.\nnasscom certificate · iiit-b alumni status · exploratory data analysis"

In [1]:
# int(input("enter the age")
w=0.9
w1=int(w)
print(w1,type(w1))

0 <class 'int'>

In [2]:
mark1=0
mark2=int(input("enter the second mark"))
mark1+mark2

enter the second mark 4

4

In [ ]:
r=int(input("enter the radius"))
b=int(input("enter the base"))
h=int(input("enter the height")) 
circle=3.14*r**2
triangle=.5*b*h
print(f'the rea of the circe is {circle} and the area of the trianle is {int(triangle)}')

In [ ]:
ages=

In [5]:
student_info={
            'st_id':[1,2,3,4,5,6,7,8,9,10],
            'name':['Aishwara','Akhila','Aparna','Chandru','Milind','pavitra',
                    'jayananth','Thillai','kavita',
                   'Khushi'],
            'marks':[50,40,80,70,60,90,70,80,60,70]
    
}

In [3]:
type(student_info)

dict

In [12]:
student_info['name'][4]=student_info['name'][4].capitalize()

In [13]:
'Milind' in student_info['name']

True

In [15]:
student_info['marks']

[50, 40, 80, 70, 60, 90, 70, 80, 60, 70]

In [18]:
sum(student_info['marks'])/len(student_info['marks'])

67.0

In [26]:
A,B=10,20
price1=10 if A<B else 20
price1

10

In [6]:
marks=[3,6,4,6,5]
for i in range(0,len(marks)-1) :
    marks[i]=marks[i]*2
print(marks)

[6, 12, 8, 12, 5]

In [9]:
for i in range(1,11):
    if i==6:
        break
    print(i)

1
2
3
4
5

In [11]:
for i in range(1,11):
    if i==6:
        print('now i is 6')
        continue
    print(i)

1
2
3
4
5
now i is 6
7
8
9
10

In [13]:
for i in range(0,11):
    if i==1:
        pass
    print(i)

0
1
2
3
4
5
6
7
8
9
10

In [2]:
student_marks=[
        {'name':'mrunal',
        'age':34,
        'marks':[2,3,4,5,6,7],
        'subject':['eng','math','science','chem','phy','bio']
},
        {'name':'sundar',
        'age':34,
        'marks':[2,3,4,2,6,7],
        'subject':['eng','math','science','chem','phy','bio']
},
        {'name':'mrinda',
        'age':34,
        'marks':[2,3,4,5,9,7],
        'subject':['eng','math','science','chem','phy','bio']
}


    
]

In [64]:
for i in range(len(student_marks)):
    ind=student_marks[i]['marks'].index(max(student_marks[i]['marks']))
    sub=student_marks[i]['subject'][ind]
    print(sub)

bio
bio
phy

In [78]:

for i in range(len(student_marks)):
    ind=student_marks[i]['marks'].index(max(student_marks[i]['marks']))
    print('{}:{}:{}'.format(student_marks[i]['name'],max(student_marks[i]['marks'])
                            ,student_marks[i]['subject'][ind] ))

mrunal:7:bio
sundar:7:bio
mrinda:9:phy

In [ ]:
sum1=input()
sum=1
for k in sum1:
    sum*=int(k)
print(sum)

In [5]:
for i in student_marks:
    if i['name']=='mrunal':
        for j in student_marks:
            print(j['marks'])

[2, 3, 4, 5, 6, 7]
[2, 3, 4, 2, 6, 7]
[2, 3, 4, 5, 9, 7]

In [11]:
i=5
j=2
for k in range(i):
    print(k,end=' ')
    for l in range(j):
        print('#',end=' ')
    print()

0 # #
1 # #
2 # #
3 # #
4 # #

In [12]:
k=[0,1,2,3,4]
i=['s1','s2','s3','s4','s5']
m=0
for j in k:
    if 's2' in i:
        for d in i:
            print(d,'is present in k list')
    else:
        for l in k:
            m+=1
print(m)

s1 is present in k list
s2 is present in k list
s3 is present in k list
s4 is present in k list
s5 is present in k list
s1 is present in k list
s2 is present in k list
s3 is present in k list
s4 is present in k list
s5 is present in k list
s1 is present in k list
s2 is present in k list
s3 is present in k list
s4 is present in k list
s5 is present in k list
s1 is present in k list
s2 is present in k list
s3 is present in k list
s4 is present in k list
s5 is present in k list
s1 is present in k list
s2 is present in k list
s3 is present in k list
s4 is present in k list
s5 is present in k list
0

In [31]:
n=6
for i in range(1,n+2):
    for k in range(1,i):
        print(k,end=' ')
    print()

1
1 2
1 2 3
1 2 3 4
1 2 3 4 5
1 2 3 4 5 6

In [29]:

for i in range(1,6):
    for k in range(6-i):
        print(k+1,end=' ')
    print()

1 2 3 4 5
1 2 3 4
1 2 3
1 2
1

In [32]:
n=6
for i in range(1,n+2):
    for k in range(1,i):
        print(k,end=' ')
    print()

for i in range(1,6):
    for k in range(6-i):
        print(k+1,end=' ')
    print()

1
1 2
1 2 3
1 2 3 4
1 2 3 4 5
1 2 3 4 5 6
1 2 3 4 5
1 2 3 4
1 2 3
1 2
1

In [61]:
for i in range(5):
    for b in range(1,5-i):
        print(' ',end='')
    for j in range(1,i+1):
        print('*',end=' ')
    print()

   *
  * *
 * * *
* * * *

In [86]:
for i in range(4):
    for b in range(1,5-i):
        print(' ',end='')
    for j in range(1,i+1):
        print('*',end=' ')
    print()
for i in range(5):
    for b in range(0,i):
        print(' ',end='')
    for j in range(1,5-i):
        print('*',end=' ')
    print()

   *
  * *
 * * *
* * * *
 * * *
  * *
   *

In [87]:
i=1
while(i<=11):
    print(i)
    i=i+1

1
2
3
4
5
6
7
8
9
10
11

In [ ]:
i=1

In [ ]:
i=1
while i<=2:
    j=1
    
    while j<5:
        print(j)
        j=j+1
    print(j)

In [1]:
i=1
while i<=10:
    j=1
    while j<=i:
        print('*',end=' ')
        j=j+1
    print()
    i=i+1

*
* *
* * *
* * * *
* * * * *
* * * * * *
* * * * * * *
* * * * * * * *
* * * * * * * * *
* * * * * * * * * *

In [4]:
i=1
while i<=5:
    j=1
    while j<=5-i:
        print(' ',end='')
        j=j+1
    k=1
    while k<=i:
        print('*',end=' ')
        k=k+1
    print()
    i=i+1

    *
   * *
  * * *
 * * * *
* * * * *

In [6]:
i=1
while i<=5:
    j=1
    while j<=5-i:
        print(' ',end='')
        j=j+1
    k=1
    while k<=i:
        print('*',end=' ')
        k=k+1
    print()
    i=i+1
i=1
while i<=5:
    j=1
    while j<=i:
        print(' ',end='')
        j=j+1
    k=1
    while k<=5-i:
        print('*',end=' ')
        k=k+1
    print()
    i=i+1

    *
   * *
  * * *
 * * * *
* * * * *
 * * * *
  * * *
   * *
    *

In [8]:
def greet(name):
    print('hai',name)
greet('hello')

hai hello

In [9]:
def greet(name='hello'):
    print('hai',name)
greet()

hai hello

In [10]:
def greet(name='hello'):
    print('hai',name)
greet('mjdj')

hai mjdj

In [15]:
def add(a,b):
    c=a+b
    return c

In [16]:
add(1,2)

3

In [ ]:
calculator()

In [20]:
def calculator(a,b):
    '''this works as a calculator'''
    c=a+b
    d=a-b
    e=a*b
    f=a/b
    l=[c,d,e,f]
    print('the sum is',c)
    print('the dif is',d)
    print('the mul is',e)
    print('the div is',f)

In [19]:
calculator(1,2)

the sum is 3
the dif is -1
the mul is 2
the div is 0.5

In [22]:
calculator.__doc__

'this works as a calculator'

In [25]:
def even(a):
    if a%2==0:
        return a

In [26]:
even(4)

4

In [28]:
even(3)

In [73]:
def string(a):
    if type(a)=='str':
        print('it is a string')
    else:
        print('it is not a string')

In [79]:
string('whatt')

it is not a string

In [77]:
def triangle(a,b,c):
    
    area=.5*a*b
    print(area)
    hyp=(a*a+b*b)**(.5)

In [76]:
triangle(4,5)

10.0

10.0

In [80]:
# def anonymous
x=lambda k: k**2

In [82]:
x(0)

0

In [85]:
area=lambda b,h: 1/2*b*h
area(1,1)

0.5

In [86]:
# *args
# unpacking of the tuple data
i,j,*k=(1,2,3,4,5,6,7)

In [87]:
print(i)
print(j)
print(k)

1
2
[3, 4, 5, 6, 7]

In [ ]:
def

In [91]:
def nums(x,*val):
    sum=x,val
    return sum

In [92]:
nums(1,3,4,2,3,3)

(1, (3, 4, 2, 3, 3))

In [99]:
def mean(*val):
   k= sum(val)/len(val)
   return k

In [100]:
mean(1,2,3)

2.0

In [5]:
def summation(*values):
    lst=list(values)
    sum=0
    for i in lst:
        sum+=i
    mean=sum/len(lst)
    print(f'sum:{sum}\nAverage:{mean}')

In [6]:
summation(1,2,3,5,4)

sum:15
Average:3.0

In [7]:
#key value
def add(**keyvalue):
    total=keyvalue
    return total

In [10]:
add(age=25,name='excelr')

{'age': 25, 'name': 'excelt'}

In [11]:
x=[1,2,3,4]
y=[2,3,4,5]
result=add(X=x,Y=y)
print(result)

{'X': [1, 2, 3, 4], 'Y': [2, 3, 4, 5]}

In [12]:
#read and write a file

In [86]:
student_marks=[
        {'name':'mrunal',
        'age':34,
        'marks':[2,3,4,5,6,7],
        'subject':['eng','math','science','chem','phy','bio']
},
        {'name':'sundar',
        'age':34,
        'marks':[2,3,4,2,6,7],
        'subject':['eng','math','science','chem','phy','bio']
},
        {'name':'mrinda',
        'age':34,
        'marks':[2,3,4,5,9,7],
        'subject':['eng','math','science','chem','phy','bio']
}   
]
with open('ans.txt','w') as f:
    markk=[]
    for i in range(len(student_marks)):
        ind=student_marks[i]['marks'].index(max(student_marks[i]['marks']))
        a='{}:{}:{}'.format(student_marks[i]['name'],max(student_marks[i]['marks'])
                              ,student_marks[i]['subject'][ind] )
        
        f.write(str(a))
        f.write('\n')

In [16]:
import os
os.getcwd()

'C:\\Users\\HP\\Data science'

In [18]:
os.listdir()

['.ipynb_checkpoints', 'Untitled.ipynb', 'untitled.py', 'untitled.txt']

In [23]:
file=open('Sample.txt',mode='r')
print(file.read())
file.close

About 1,16,00,00,000 results (0.54 seconds)

Learn Python - Free Interactive Python Tutorial

Learn Python
https://www.learnpython.org
Get started learning Python with DataCamp's free Intro to Python tutorial. Learn Data Science by completing interactive coding challenges and watching videos by ...
â€ŽHello, World! Â· â€ŽVariables and Types Â· â€ŽLists Â· â€ŽBasic Operators

Python Tutorial

W3Schools
https://www.w3schools.com â€º python
Learn Python. Python is a popular programming language. Python can be used on a server to create web applications. Start learning Python now Â». Learning by ...
â€ŽPython Introduction Â· â€ŽPython Lists Â· â€ŽPython Strings Â· â€ŽPython Variables

Python For Beginners

Python
https://www.python.org â€º about â€º gettingstarted
Learning. Before getting started, you may want to find out which IDEs and text editors are tailored to make Python editing easy, browse the list of introductory ...

Learn Python 3

Codecademy
https://www.codecademy.com â€º learn â€º learn-python-3
Learn Python 3 course ratings and reviews ... Awesome course, understandable from the beginner and able to guide you step-by-step into using python for real stuff ...

Learn Python 2

Codecademy
https://www.codecademy.com â€º learn â€º learn-python
Related courses and paths Â· Free course. Python for Programmers. An introduction to the basic syntax and fundamentals of Python for experienced programmers.

Learn Python Programming

Programiz
https://www.programiz.com â€º python-programming
Python is a powerful general-purpose programming language. Our Python tutorial will guide you to learn Python one step at a time with the help of examples.
People also ask
Is it hard to learn Python?
Can I learn Python in 3 days?
Can I learn Python myself?
Should I learn Python first or C++?
Feedback

Learn Python - Full Course for Beginners [Tutorial] - YouTube

YouTube Â· freeCodeCamp.org
4.3Cr+ views Â· 5 years ago

4:26:52
This course will give you a full introduction into all of the core concepts in python. Follow along with the videos and you'll be a python ...
25 key moments
 in this video

Python for beginners - Training

Microsoft Learn
https://learn.microsoft.com â€º Learn â€º Training â€º Browse
Get started with Python! Learn how to create programs and projects in Python. Work with strings, lists, loops, dictionaries, and functions.

Python Tutorial | Learn Python Programming

GeeksforGeeks
https://www.geeksforgeeks.org â€º python-programmin...
3 days ago â€” This Python tutorial is well-suited for beginners as well as professionals, covering basic to advanced concepts of the Python programming ...

The Python Tutorial â€” Python 3.12.1 documentation

Python Docs
https://docs.python.org â€º tutorial
Python is an easy to learn, powerful programming language. It has efficient high-level data structures and a simple but effective approach to ...

In [28]:
file=open('Sample.txt',mode='r')
print(file.readline())
file.close()

About 1,16,00,00,000 results (0.54 seconds)

In [29]:
file=open('Sample.txt',mode='r')
print(file.readlines())
file.close()

['About 1,16,00,00,000 results (0.54 seconds) \n', '\n', 'Learn Python - Free Interactive Python Tutorial\n', '\n', 'Learn Python\n', 'https://www.learnpython.org\n', "Get started learning Python with DataCamp's free Intro to Python tutorial. Learn Data Science by completing interactive coding challenges and watching videos by ...\n", 'â€ŽHello, World! Â· â€ŽVariables and Types Â· â€ŽLists Â· â€ŽBasic Operators\n', '\n', 'Python Tutorial\n', '\n', 'W3Schools\n', 'https://www.w3schools.com â€º python\n', 'Learn Python. Python is a popular programming language. Python can be used on a server to create web applications. Start learning Python now Â». Learning by ...\n', 'â€ŽPython Introduction Â· â€ŽPython Lists Â· â€ŽPython Strings Â· â€ŽPython Variables\n', '\n', 'Python For Beginners\n', '\n', 'Python\n', 'https://www.python.org â€º about â€º gettingstarted\n', 'Learning. Before getting started, you may want to find out which IDEs and text editors are tailored to make Python editing easy, browse the list of introductory ...\n', '\n', 'Learn Python 3\n', '\n', 'Codecademy\n', 'https://www.codecademy.com â€º learn â€º learn-python-3\n', 'Learn Python 3 course ratings and reviews ... Awesome course, understandable from the beginner and able to guide you step-by-step into using python for real stuff ...\n', '\n', 'Learn Python 2\n', '\n', 'Codecademy\n', 'https://www.codecademy.com â€º learn â€º learn-python\n', 'Related courses and paths Â· Free course. Python for Programmers. An introduction to the basic syntax and fundamentals of Python for experienced programmers.\n', '\n', 'Learn Python Programming\n', '\n', 'Programiz\n', 'https://www.programiz.com â€º python-programming\n', 'Python is a powerful general-purpose programming language. Our Python tutorial will guide you to learn Python one step at a time with the help of examples.\n', 'People also ask\n', 'Is it hard to learn Python?\n', 'Can I learn Python in 3 days?\n', 'Can I learn Python myself?\n', 'Should I learn Python first or C++?\n', 'Feedback\n', '\n', 'Learn Python - Full Course for Beginners [Tutorial] - YouTube\n', '\n', 'YouTube Â· freeCodeCamp.org\n', '4.3Cr+ views Â· 5 years ago\n', '\n', '4:26:52\n', "This course will give you a full introduction into all of the core concepts in python. Follow along with the videos and you'll be a python ...\n", '25 key moments\n', ' in this video\n', '\n', 'Python for beginners - Training\n', '\n', 'Microsoft Learn\n', 'https://learn.microsoft.com â€º Learn â€º Training â€º Browse\n', 'Get started with Python! Learn how to create programs and projects in Python. Work with strings, lists, loops, dictionaries, and functions.\n', '\n', 'Python Tutorial | Learn Python Programming\n', '\n', 'GeeksforGeeks\n', 'https://www.geeksforgeeks.org â€º python-programmin...\n', '3 days ago â€” This Python tutorial is well-suited for beginners as well as professionals, covering basic to advanced concepts of the Python programming ...\n', '\n', 'The Python Tutorial â€” Python 3.12.1 documentation\n', '\n', 'Python Docs\n', 'https://docs.python.org â€º tutorial\n', 'Python is an easy to learn, powerful programming language. It has efficient high-level data structures and a simple but effective approach to ...']

In [ ]:
file=open('Sample.txt',mode='r')
print(file.readlines())
file.close()

In [31]:
file=open('Sample.txt',mode='r')
for i in file.readlines():
    print(i)
file.close()

About 1,16,00,00,000 results (0.54 seconds)



Learn Python - Free Interactive Python Tutorial



Learn Python

https://www.learnpython.org

Get started learning Python with DataCamp's free Intro to Python tutorial. Learn Data Science by completing interactive coding challenges and watching videos by ...

â€ŽHello, World! Â· â€ŽVariables and Types Â· â€ŽLists Â· â€ŽBasic Operators



Python Tutorial



W3Schools

https://www.w3schools.com â€º python

Learn Python. Python is a popular programming language. Python can be used on a server to create web applications. Start learning Python now Â». Learning by ...

â€ŽPython Introduction Â· â€ŽPython Lists Â· â€ŽPython Strings Â· â€ŽPython Variables



Python For Beginners



Python

https://www.python.org â€º about â€º gettingstarted

Learning. Before getting started, you may want to find out which IDEs and text editors are tailored to make Python editing easy, browse the list of introductory ...



Learn Python 3



Codecademy

https://www.codecademy.com â€º learn â€º learn-python-3

Learn Python 3 course ratings and reviews ... Awesome course, understandable from the beginner and able to guide you step-by-step into using python for real stuff ...



Learn Python 2



Codecademy

https://www.codecademy.com â€º learn â€º learn-python

Related courses and paths Â· Free course. Python for Programmers. An introduction to the basic syntax and fundamentals of Python for experienced programmers.



Learn Python Programming



Programiz

https://www.programiz.com â€º python-programming

Python is a powerful general-purpose programming language. Our Python tutorial will guide you to learn Python one step at a time with the help of examples.

People also ask

Is it hard to learn Python?

Can I learn Python in 3 days?

Can I learn Python myself?

Should I learn Python first or C++?

Feedback



Learn Python - Full Course for Beginners [Tutorial] - YouTube



YouTube Â· freeCodeCamp.org

4.3Cr+ views Â· 5 years ago



4:26:52

This course will give you a full introduction into all of the core concepts in python. Follow along with the videos and you'll be a python ...

25 key moments

 in this video



Python for beginners - Training



Microsoft Learn

https://learn.microsoft.com â€º Learn â€º Training â€º Browse

Get started with Python! Learn how to create programs and projects in Python. Work with strings, lists, loops, dictionaries, and functions.



Python Tutorial | Learn Python Programming



GeeksforGeeks

https://www.geeksforgeeks.org â€º python-programmin...

3 days ago â€” This Python tutorial is well-suited for beginners as well as professionals, covering basic to advanced concepts of the Python programming ...



The Python Tutorial â€” Python 3.12.1 documentation



Python Docs

https://docs.python.org â€º tutorial

Python is an easy to learn, powerful programming language. It has efficient high-level data structures and a simple but effective approach to ...

In [34]:
file=open('Sample.txt',mode='r')
for i in file.readlines():
    java=i.replace('Python','java')
    print(java)
file.close()

About 1,16,00,00,000 results (0.54 seconds)



Learn java - Free Interactive java Tutorial



Learn java

https://www.learnpython.org

Get started learning java with DataCamp's free Intro to java tutorial. Learn Data Science by completing interactive coding challenges and watching videos by ...

â€ŽHello, World! Â· â€ŽVariables and Types Â· â€ŽLists Â· â€ŽBasic Operators



java Tutorial



W3Schools

https://www.w3schools.com â€º python

Learn java. java is a popular programming language. java can be used on a server to create web applications. Start learning java now Â». Learning by ...

â€Žjava Introduction Â· â€Žjava Lists Â· â€Žjava Strings Â· â€Žjava Variables



java For Beginners



java

https://www.python.org â€º about â€º gettingstarted

Learning. Before getting started, you may want to find out which IDEs and text editors are tailored to make java editing easy, browse the list of introductory ...



Learn java 3



Codecademy

https://www.codecademy.com â€º learn â€º learn-python-3

Learn java 3 course ratings and reviews ... Awesome course, understandable from the beginner and able to guide you step-by-step into using python for real stuff ...



Learn java 2



Codecademy

https://www.codecademy.com â€º learn â€º learn-python

Related courses and paths Â· Free course. java for Programmers. An introduction to the basic syntax and fundamentals of java for experienced programmers.



Learn java Programming



Programiz

https://www.programiz.com â€º python-programming

java is a powerful general-purpose programming language. Our java tutorial will guide you to learn java one step at a time with the help of examples.

People also ask

Is it hard to learn java?

Can I learn java in 3 days?

Can I learn java myself?

Should I learn java first or C++?

Feedback



Learn java - Full Course for Beginners [Tutorial] - YouTube



YouTube Â· freeCodeCamp.org

4.3Cr+ views Â· 5 years ago



4:26:52

This course will give you a full introduction into all of the core concepts in python. Follow along with the videos and you'll be a python ...

25 key moments

 in this video



java for beginners - Training



Microsoft Learn

https://learn.microsoft.com â€º Learn â€º Training â€º Browse

Get started with java! Learn how to create programs and projects in java. Work with strings, lists, loops, dictionaries, and functions.



java Tutorial | Learn java Programming



GeeksforGeeks

https://www.geeksforgeeks.org â€º python-programmin...

3 days ago â€” This java tutorial is well-suited for beginners as well as professionals, covering basic to advanced concepts of the java programming ...



The java Tutorial â€” java 3.12.1 documentation



java Docs

https://docs.python.org â€º tutorial

java is an easy to learn, powerful programming language. It has efficient high-level data structures and a simple but effective approach to ...

In [39]:
lines='this is a  file'
with open('readme.txt','w') as f:
    f.write(lines)

In [41]:
lines='''this is a  file
this is a  file
this is a  file
'''
with open('multil.txt','w') as f:
    f.write(lines)

In [45]:
lines=['this is a  file',
'this is a  file',
'this is a  file'
]
with open('multil.txt','w') as f:
    f.writelines(lines)

In [52]:
with open('multil.txt','a') as f:
    for i in lines:
        f.write(i)
        f.write('\n')

In [ ]:
with open

In [91]:
!pip install pandas
!pip install numpy
!pip install matplotlib
!pip install seaborn

Requirement already satisfied: pandas in c:\users\hp\appdata\roaming\python\python311\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: numpy in c:\users\hp\appdata\roaming\python\python311\site-packages (1.24.2)

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: matplotlib in c:\users\hp\appdata\roaming\python\python311\site-packages (3.7.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (1.0.7)
Requirement already satisfied: cycler>=0.10 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (4.39.4)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: numpy>=1.20 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (1.24.2)
Requirement already satisfied: packaging>=20.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (9.5.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: seaborn in c:\users\hp\anaconda3\lib\site-packages (0.12.2)
Requirement already satisfied: numpy!=1.24.0,>=1.17 in c:\users\hp\appdata\roaming\python\python311\site-packages (from seaborn) (1.24.2)
Requirement already satisfied: pandas>=0.25 in c:\users\hp\appdata\roaming\python\python311\site-packages (from seaborn) (1.5.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from seaborn) (3.7.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.0.7)
Requirement already satisfied: cycler>=0.10 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.39.4)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.5.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\hp\appdata\roaming\python\python311\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\roaming\python\python311\site-packages (from pandas>=0.25->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas
import numpy
import matplotlib
import seaborn

In [ ]:
#Exception  handling

In [15]:
3/0

ZeroDivisionError: division by zero

In [20]:
a=10
b=0
try :
    c=a/b
    print(c)
except ZeroDivisionError as e :
    print(e)
print(c)

division by zero
10

In [23]:
a=10
b='ab'
try :
    c=a+b
    d=a*b
    print(c)
except TypeError as e :
    print(e)
except NameError as n:
    print(n)   
print(a*b)

unsupported operand type(s) for +: 'int' and 'str'
abababababababababab

In [24]:
import os
os.getcwd()

'C:\\Users\\HP\\Data science'

In [26]:
try:
    f=open('Samplee.txt','r')
    f.write('dfdsddd')
except Exception as e:
    f=open('Sample.txt','r')
    print(f.read())

About 1,16,00,00,000 results (0.54 seconds)

Learn Python - Free Interactive Python Tutorial

Learn Python
https://www.learnpython.org
Get started learning Python with DataCamp's free Intro to Python tutorial. Learn Data Science by completing interactive coding challenges and watching videos by ...
â€ŽHello, World! Â· â€ŽVariables and Types Â· â€ŽLists Â· â€ŽBasic Operators

Python Tutorial

W3Schools
https://www.w3schools.com â€º python
Learn Python. Python is a popular programming language. Python can be used on a server to create web applications. Start learning Python now Â». Learning by ...
â€ŽPython Introduction Â· â€ŽPython Lists Â· â€ŽPython Strings Â· â€ŽPython Variables

Python For Beginners

Python
https://www.python.org â€º about â€º gettingstarted
Learning. Before getting started, you may want to find out which IDEs and text editors are tailored to make Python editing easy, browse the list of introductory ...

Learn Python 3

Codecademy
https://www.codecademy.com â€º learn â€º learn-python-3
Learn Python 3 course ratings and reviews ... Awesome course, understandable from the beginner and able to guide you step-by-step into using python for real stuff ...

Learn Python 2

Codecademy
https://www.codecademy.com â€º learn â€º learn-python
Related courses and paths Â· Free course. Python for Programmers. An introduction to the basic syntax and fundamentals of Python for experienced programmers.

Learn Python Programming

Programiz
https://www.programiz.com â€º python-programming
Python is a powerful general-purpose programming language. Our Python tutorial will guide you to learn Python one step at a time with the help of examples.
People also ask
Is it hard to learn Python?
Can I learn Python in 3 days?
Can I learn Python myself?
Should I learn Python first or C++?
Feedback

Learn Python - Full Course for Beginners [Tutorial] - YouTube

YouTube Â· freeCodeCamp.org
4.3Cr+ views Â· 5 years ago

4:26:52
This course will give you a full introduction into all of the core concepts in python. Follow along with the videos and you'll be a python ...
25 key moments
 in this video

Python for beginners - Training

Microsoft Learn
https://learn.microsoft.com â€º Learn â€º Training â€º Browse
Get started with Python! Learn how to create programs and projects in Python. Work with strings, lists, loops, dictionaries, and functions.

Python Tutorial | Learn Python Programming

GeeksforGeeks
https://www.geeksforgeeks.org â€º python-programmin...
3 days ago â€” This Python tutorial is well-suited for beginners as well as professionals, covering basic to advanced concepts of the Python programming ...

The Python Tutorial â€” Python 3.12.1 documentation

Python Docs
https://docs.python.org â€º tutorial
Python is an easy to learn, powerful programming language. It has efficient high-level data structures and a simple but effective approach to ...

In [31]:
try:
    f=open('Samplee.txt','r')
    f.write('dfdsddd')
except IOError as e:
    print(e)
except TypeError as e:
    print(e)
else:
    print('content read sucess')

[Errno 2] No such file or directory: 'Samplee.txt'

In [32]:
try:
    f=open('Samplee.txt','r')
    f.write('dfdsddd')
except Exception as e:
    print(e)
finally:
    print("Always excecute finally code block")

[Errno 2] No such file or directory: 'Samplee.txt'
Always excecute finally code block

In [34]:
def askint():
    try:
        val=int(input("enter the value"))
    except:
        print("u didnt enter an integer")
    finally:
        print('value',val)

In [35]:
askint()

enter the value 54

value 54

In [36]:
def fun(a):
    if a<4:
        c=a/(a-3)
        print('the value is',c)

In [37]:
try:
    fun(2)
except(ZeroDivisionError,UnboundLocalError,TypeError):
    print('Error')

the value is -2.0

In [ ]:
x=

In [38]:
x=-1
if x<0:
    raise Exception("sorry n number below 0")
print(x)

Exception: sorry n number below 0

In [45]:
k=int(input('Enter the number'))
if not type(k) is int:
        raise TypeError("sorry n number below 0")
print(k)

Enter the number d

ValueError: invalid literal for int() with base 10: 'd'

In [ ]:
im

In [6]:
import pandas as pd

In [2]:
List=[1,2,3,4,4,5,6,6,7]
ser=pd.Series(List)
ser

0    1
1    2
2    3
3    4
4    4
5    5
6    6
7    6
8    7
dtype: int64

In [4]:
ser.head(1),ser.tail(1)

(0    1
 dtype: int64,
 8    7
 dtype: int64)

In [5]:
ser[0:9:2]

0    1
2    3
4    4
6    6
8    7
dtype: int64

In [6]:
ser[2]=6.5

In [60]:
print(ser)

0    1.0
1    2.0
2    6.5
3    4.0
4    4.0
5    5.0
6    6.0
7    6.0
8    7.0
dtype: float64

In [7]:
ser1 = pd.Series(List,name='age',index=['a','b','c','d','e','f','g','h','i'],dtype='string')

In [8]:
ser1['a':'d']

a    1
b    2
c    3
d    4
Name: age, dtype: string

In [9]:
ser1=ser1.astype('int64')
type(ser1[0])

numpy.int64

In [10]:
ser1.mean(),ser1.median(),ser1.mode()

(4.222222222222222,
 4.0,
 0    4
 1    6
 Name: age, dtype: int64)

In [11]:
ser1.mean()==ser1.median()==ser1.mode()

False

In [12]:
data={
        "name":[
            "nikk","stop","start","inception"
            ],
        "age":[1,2,3,4],
        "Sex":['male','male','male','female'],
        "Education":["d",'l','d','g']

    
}

In [13]:
df=pd.DataFrame(data)
df

        name  age     Sex Education
0       nikk    1    male         d
1       stop    2    male         l
2      start    3    male         d
3  inception    4  female         g

In [14]:
df.dtypes

name         object
age           int64
Sex          object
Education    object
dtype: object

In [15]:
df.columns

Index(['name', 'age', 'Sex', 'Education'], dtype='object')

In [16]:
df.values

array([['nikk', 1, 'male', 'd'],
       ['stop', 2, 'male', 'l'],
       ['start', 3, 'male', 'd'],
       ['inception', 4, 'female', 'g']], dtype=object)

In [17]:
df['age'][2]=0

C:\Users\HP\AppData\Local\Temp\ipykernel_30328\310172179.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age'][2]=0

In [18]:
df.values

array([['nikk', 1, 'male', 'd'],
       ['stop', 2, 'male', 'l'],
       ['start', 0, 'male', 'd'],
       ['inception', 4, 'female', 'g']], dtype=object)

In [19]:
df['age'].mean()

1.75

In [20]:
df['gender']=df['Sex']

In [21]:
df

        name  age     Sex Education  gender
0       nikk    1    male         d    male
1       stop    2    male         l    male
2      start    0    male         d    male
3  inception    4  female         g  female

In [22]:
df.drop('Sex',axis=1,inplace=True)

In [23]:
df

        name  age Education  gender
0       nikk    1         d    male
1       stop    2         l    male
2      start    0         d    male
3  inception    4         g  female

In [24]:
df[df['gender']=='male']

    name  age Education gender
0   nikk    1         d   male
1   stop    2         l   male
2  start    0         d   male

In [25]:
df[df['Education']=='d']

    name  age Education gender
0   nikk    1         d   male
2  start    0         d   male

In [27]:
df['gender']=='male'

0     True
1     True
2     True
3    False
Name: gender, dtype: bool

In [44]:
df_male=df[df['gender']=='male']
df_male['age'].mean()

1.0

In [8]:
salaries_df=pd.read_csv(r"C:\Users\HP\Downloads\Salaries2.csv")
salaries_df

         rank discipline   phd  service     sex  salary
0        Prof          A  51.0       51    Male   57800
1   AssocProf          A  25.0       22  Female   62884
2    AsstProf          A   7.0        6  Female   63100
3   AssocProf          B  12.0        9  Female   71065
4    AsstProf          B   2.0        0  Female   72500
..        ...        ...   ...      ...     ...     ...
73       Prof          B  22.0       21    Male  155750
74       Prof          A  45.0       43    Male  155865
75       Prof          B  24.0       15  Female  161101
76       Prof          B  35.0       33    Male  162200
77       Prof          B  56.0       49    Male  186960

[78 rows x 6 columns]

In [47]:
salaries_df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [41]:
salaries_df.shape

(78, 6)

In [39]:
salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  73 non-null     object
 2   phd         75 non-null     float64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: float64(1), int64(2), object(3)
memory usage: 3.8+ KB

In [40]:
salaries_df.describe()

             phd    service         salary
count  75.000000  78.000000      78.000000
mean   19.626667  15.051282  108023.782051
std    12.803899  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%     9.500000   5.250000   88612.500000
50%    18.000000  14.500000  104671.000000
75%    28.000000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [48]:
salaries_df.head(),salaries_df.tail()

(        rank discipline   phd  service     sex  salary
 0       Prof          A  51.0       51    Male   57800
 1  AssocProf          A  25.0       22  Female   62884
 2   AsstProf          A   7.0        6  Female   63100
 3  AssocProf          B  12.0        9  Female   71065
 4   AsstProf          B   2.0        0  Female   72500,
     rank discipline   phd  service     sex  salary
 73  Prof          B  22.0       21    Male  155750
 74  Prof          A  45.0       43    Male  155865
 75  Prof          B  24.0       15  Female  161101
 76  Prof          B  35.0       33    Male  162200
 77  Prof          B  56.0       49    Male  186960)

In [49]:
salaries_df.describe(include='all')

        rank discipline        phd    service   sex         salary
count     78         73  75.000000  78.000000    78      78.000000
unique     3          2        NaN        NaN     2            NaN
top     Prof          B        NaN        NaN  Male            NaN
freq      46         40        NaN        NaN    39            NaN
mean     NaN        NaN  19.626667  15.051282   NaN  108023.782051
std      NaN        NaN  12.803899  12.139768   NaN   28293.661022
min      NaN        NaN   1.000000   0.000000   NaN   57800.000000
25%      NaN        NaN   9.500000   5.250000   NaN   88612.500000
50%      NaN        NaN  18.000000  14.500000   NaN  104671.000000
75%      NaN        NaN  28.000000  20.750000   NaN  126774.750000
max      NaN        NaN  56.000000  51.000000   NaN  186960.000000

In [50]:
salaries_df.describe(exclude='float')

        rank discipline    service   sex         salary
count     78         73  78.000000    78      78.000000
unique     3          2        NaN     2            NaN
top     Prof          B        NaN  Male            NaN
freq      46         40        NaN    39            NaN
mean     NaN        NaN  15.051282   NaN  108023.782051
std      NaN        NaN  12.139768   NaN   28293.661022
min      NaN        NaN   0.000000   NaN   57800.000000
25%      NaN        NaN   5.250000   NaN   88612.500000
50%      NaN        NaN  14.500000   NaN  104671.000000
75%      NaN        NaN  20.750000   NaN  126774.750000
max      NaN        NaN  51.000000   NaN  186960.000000

In [51]:
salaries_df.describe(exclude=['float','int'])

        rank discipline   sex
count     78         73    78
unique     3          2     2
top     Prof          B  Male
freq      46         40    39

In [52]:
salaries_df['rank'].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [53]:
salaries_df['discipline'].value_counts()

B    40
A    33
Name: discipline, dtype: int64

In [54]:
salaries_df['sex'].value_counts()

Male      39
Female    39
Name: sex, dtype: int64

In [55]:
salaries_df['salary'].mean()

108023.78205128205

In [57]:
salary_prof=salaries_df[salaries_df['rank']=='Prof']
salary_prof

    rank discipline   phd  service     sex  salary
0   Prof          A  51.0       51    Male   57800
20  Prof          A  17.0       11  Female   90450
22  Prof          A  29.0       27  Female   91000
23  Prof          A  30.0       23    Male   91100
28  Prof          A  12.0        6    Male   93000
29  Prof          A  29.0       19    Male   94350
31  Prof        NaN  35.0       31    Male   99418
32  Prof          A   NaN        8    Male  102000
33  Prof          A  33.0       30    Male  103106
34  Prof          A  27.0       19    Male  103275
39  Prof          B  20.0       18    Male  104800
40  Prof          A  12.0        0  Female  105000
41  Prof          B  18.0       10  Female  105450
43  Prof        NaN  19.0        7    Male  107300
44  Prof          A  23.0       15  Female  109646
46  Prof          A  28.0       14  Female  109954
47  Prof          A  23.0       20    Male  110515
48  Prof          B   NaN       17  Female  111512
49  Prof          A  28.0        7  Female  116450
50  Prof          A  36.0       19  Female  117555
52  Prof          B  18.0       18    Male  120000
53  Prof          A  20.0       20    Male  122400
54  Prof          B  17.0       18  Female  122960
55  Prof          B  21.0       20    Male  123683
56  Prof        NaN  17.0       17  Female  124312
57  Prof          A  18.0       18    Male  126300
58  Prof          B  28.0       23    Male  126933
59  Prof          B  20.0       14  Female  127512
60  Prof          B  39.0       33    Male  128250
61  Prof          B  18.0       18  Female  129000
62  Prof          A  40.0       31    Male  131205
63  Prof          B  23.0       23    Male  134778
64  Prof          A  39.0       36  Female  137000
65  Prof          B  25.0       25  Female  140096
66  Prof          B  36.0       26  Female  144651
67  Prof          B  45.0       45    Male  146856
68  Prof          A  38.0       19    Male  148750
69  Prof          B  17.0        3    Male  150480
70  Prof        NaN  29.0       27    Male  150500
71  Prof          B   NaN       19  Female  151768
72  Prof          B  25.0       19    Male  153750
73  Prof          B  22.0       21    Male  155750
74  Prof          A  45.0       43    Male  155865
75  Prof          B  24.0       15  Female  161101
76  Prof          B  35.0       33    Male  162200
77  Prof          B  56.0       49    Male  186960

In [67]:
salary_M_prof=salaries_df[(salaries_df['rank']=='Prof') &(salaries_df['sex']=='Male')]
salary_M_prof

    rank discipline   phd  service   sex  salary
0   Prof          A  51.0       51  Male   57800
23  Prof          A  30.0       23  Male   91100
28  Prof          A  12.0        6  Male   93000
29  Prof          A  29.0       19  Male   94350
31  Prof        NaN  35.0       31  Male   99418
32  Prof          A   NaN        8  Male  102000
33  Prof          A  33.0       30  Male  103106
34  Prof          A  27.0       19  Male  103275
39  Prof          B  20.0       18  Male  104800
43  Prof        NaN  19.0        7  Male  107300
47  Prof          A  23.0       20  Male  110515
52  Prof          B  18.0       18  Male  120000
53  Prof          A  20.0       20  Male  122400
55  Prof          B  21.0       20  Male  123683
57  Prof          A  18.0       18  Male  126300
58  Prof          B  28.0       23  Male  126933
60  Prof          B  39.0       33  Male  128250
62  Prof          A  40.0       31  Male  131205
63  Prof          B  23.0       23  Male  134778
67  Prof          B  45.0       45  Male  146856
68  Prof          A  38.0       19  Male  148750
69  Prof          B  17.0        3  Male  150480
70  Prof        NaN  29.0       27  Male  150500
72  Prof          B  25.0       19  Male  153750
73  Prof          B  22.0       21  Male  155750
74  Prof          A  45.0       43  Male  155865
76  Prof          B  35.0       33  Male  162200
77  Prof          B  56.0       49  Male  186960

In [69]:
salary_M_prof['salary'].mean()

124690.14285714286

In [71]:
salaries_df.loc[10:15][['salary','rank']]

    salary       rank
10   74830  AssocProf
11   75044   AsstProf
12   77000   AsstProf
13   77500  AssocProf
14   77500   AsstProf
15   78500   AsstProf

In [81]:
m=salaries_df.loc[:10,['salary']].mean()
m

salary    69924.636364
dtype: float64

In [82]:
salaries_df.loc[[10,2,3,4,5,8,]][['salary','rank']]

    salary       rank
10   74830  AssocProf
2    63100   AsstProf
3    71065  AssocProf
4    72500   AsstProf
5    72500   AsstProf
8    73500   AsstProf

In [85]:
df_rank=salaries_df.iloc[0:45,3]
df_rank

0     51
1     22
2      6
3      9
4      0
5      1
6      2
7     24
8      3
9      3
10     8
11     3
12     0
13     8
14     2
15     3
16     2
17    17
18     0
19     0
20    11
21     3
22    27
23    23
24     2
25     0
26     4
27     3
28     6
29    19
30     5
31    31
32     8
33    30
34    19
35    11
36    10
37    10
38     6
39    18
40     0
41    10
42     7
43     7
44    15
Name: service, dtype: int64

In [86]:
salaries_df.iloc[0:5,[1,3,4]]

  discipline  service     sex
0          A       51    Male
1          A       22  Female
2          A        6  Female
3          B        9  Female
4          B        0  Female

In [87]:
salaries_df.iloc[0:5][['salary','rank']]

   salary       rank
0   57800       Prof
1   62884  AssocProf
2   63100   AsstProf
3   71065  AssocProf
4   72500   AsstProf

In [90]:
df_highest_salary=salaries_df.sort_values(by='salary')
df_highest_salary

         rank discipline   phd  service     sex  salary
0        Prof          A  51.0       51    Male   57800
1   AssocProf          A  25.0       22  Female   62884
2    AsstProf          A   7.0        6  Female   63100
3   AssocProf          B  12.0        9  Female   71065
4    AsstProf          B   2.0        0  Female   72500
..        ...        ...   ...      ...     ...     ...
73       Prof          B  22.0       21    Male  155750
74       Prof          A  45.0       43    Male  155865
75       Prof          B  24.0       15  Female  161101
76       Prof          B  35.0       33    Male  162200
77       Prof          B  56.0       49    Male  186960

[78 rows x 6 columns]

In [92]:
df_highest_salary=salaries_df.sort_values(by='salary',ascending=False)
df_highest_salary.head()

    rank discipline   phd  service     sex  salary
77  Prof          B  56.0       49    Male  186960
76  Prof          B  35.0       33    Male  162200
75  Prof          B  24.0       15  Female  161101
74  Prof          A  45.0       43    Male  155865
73  Prof          B  22.0       21    Male  155750

In [15]:
associate=salaries_df.loc[:10,['salary']].sort_values(by='salary',ascending=False)
associate

    salary
10   74830
9    74692
8    73500
7    73300
6    73000
4    72500
5    72500
3    71065
2    63100
1    62884
0    57800

In [96]:
mean_salary=salaries_df.groupby(['sex','rank'])['salary','phd'].mean()
mean_salary

C:\Users\HP\AppData\Local\Temp\ipykernel_30328\2804524007.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  mean_salary=salaries_df.groupby(['sex','rank'])['salary','phd'].mean()

                         salary        phd
sex    rank
Female AssocProf   88512.800000  15.000000
       AsstProf    78049.909091   5.636364
       Prof       121967.611111  24.187500
Male   AssocProf  102697.666667  13.666667
       AsstProf    85918.000000   4.250000
       Prof       124690.142857  29.555556

In [18]:
mean_count=salaries_df.groupby(['sex','rank'])['salary','phd'].count()

C:\Users\HP\AppData\Local\Temp\ipykernel_11912\2271712821.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  mean_count=salaries_df.groupby(['sex','rank'])['salary','phd'].count()

In [128]:
mean_salary=salaries_df.groupby(['sex','rank'])['salary'].mean()
mean_salary.Female

rank
AssocProf     88512.800000
AsstProf      78049.909091
Prof         121967.611111
Name: salary, dtype: float64

In [130]:
pivot_values=salaries_df.pivot_table(values=['salary','phd','service'],
                                    columns=['rank','sex','discipline'],
                                    aggfunc='mean')
pivot_values

rank           AssocProf                                  AsstProf  \
sex               Female                   Male             Female
discipline             A             B        A         B        A
phd            18.666667     13.500000     20.0      10.5      5.4
salary      71228.000000  99435.666667  81285.0  113404.0  73020.0
service        18.000000      8.833333     17.0       7.5      3.0

rank                                                   Prof                 \
sex                               Male               Female
discipline             B             A        B           A              B
phd             5.833333      2.333333      5.4      26.500      22.571429
salary      82241.500000  82000.000000  88268.8  109631.875  132672.222222
service         2.166667      0.666667      2.4      16.125      18.000000

rank
sex                  Male
discipline              A              B
phd             30.500000      29.083333
salary      110743.538462  141203.333333
service         23.615385      25.416667

In [131]:
pivot_values=salaries_df.pivot_table(values=['salary','phd','service'],
                                    columns=['rank','sex','discipline'],
                                    aggfunc={'salary':'mean',
                                    'phd':'count',
                                    'service':'min'})
pivot_values

rank       AssocProf                                  AsstProf           \
sex           Female                   Male             Female
discipline         A             B        A         B        A        B
phd              3.0      6.000000      1.0       2.0      5.0      6.0
salary       71228.0  99435.666667  81285.0  113404.0  73020.0  82241.5
service          8.0      6.000000     17.0       7.0      1.0      0.0

rank                                Prof                                \
sex            Male               Female                          Male
discipline        A        B           A              B              A
phd             3.0      5.0       8.000       7.000000      12.000000
salary      82000.0  88268.8  109631.875  132672.222222  110743.538462
service         0.0      0.0       0.000      10.000000       6.000000

rank
sex
discipline              B
phd             12.000000
salary      141203.333333
service          3.000000

In [132]:
salaries_df.isna()

     rank  discipline    phd  service    sex  salary
0   False       False  False    False  False   False
1   False       False  False    False  False   False
2   False       False  False    False  False   False
3   False       False  False    False  False   False
4   False       False  False    False  False   False
..    ...         ...    ...      ...    ...     ...
73  False       False  False    False  False   False
74  False       False  False    False  False   False
75  False       False  False    False  False   False
76  False       False  False    False  False   False
77  False       False  False    False  False   False

[78 rows x 6 columns]

In [136]:
salaries_df.isna().sum()

rank          0
discipline    5
phd           3
service       0
sex           0
salary        0
dtype: int64

In [137]:
mode_dc=salaries_df['discipline'].mode()[0]
mode_dc

'B'

In [139]:
mean_phd=round(salaries_df['phd'].mean(),2)
mean_phd

19.63

In [141]:
salaries_df['discipline'].fillna(mode_dc,inplace=True)

In [142]:
salaries_df['phd'].fillna(mean_phd,inplace=True)

In [143]:
salaries_df.isna().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [20]:
train_df=pd.read_csv(r"C:\Users\HP\Downloads\train1.csv")
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [145]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [146]:
train_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [147]:
train_df['Cabin'].bfill(inplace=True)

In [148]:
train_df['Cabin'].ffill(inplace=True)

In [150]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin            0
Embarked         2
dtype: int64

In [152]:
train_df['Embarked'].ffill(inplace=True)

In [153]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin            0
Embarked         0
dtype: int64

In [154]:
train_df['Age'].interpolate(method='linear',inplace=True)

In [155]:
train_df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [32]:
male=train_df[train_df['Sex']=='male'].count()
male['Sex']

577

In [38]:
avg_price=train_df.groupby('Sex')['Fare'].mean()
avg_price

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [76]:
import numpy as np

In [48]:
arr=[1,2,3,4,5,6,7,8,0]
arr=np.array(arr)
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 0])

In [49]:
arr_ser=pd.Series(arr)
arr_ser.values

array([1, 2, 3, 4, 5, 6, 7, 8, 0])

In [50]:
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 0])

In [51]:
arr.ndim

1

In [52]:
arr.shape

(9,)

In [ ]:
arr.view()

arr.size,arr.min(),arr.max()

arr.mean(),arr.sum()

In [87]:
arr1=np.array([[1,2],
      [3,4],
      [5,6]])

In [88]:
arr1.shape

(3, 2)

In [89]:
arr1.ndim

2

In [91]:
print(np.zeros([1,3,6]))
print(np.empty(10))
print(np.linspace(1,10,num=30))

[[[0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 0. 0.]]]
[1.10343781e-312 9.76118064e-313 1.16709769e-312 1.18831764e-312
 1.18831764e-312 1.06099790e-312 9.76118064e-313 1.06099790e-312
 1.18831764e-312 1.08221785e-312]
[ 1.          1.31034483  1.62068966  1.93103448  2.24137931  2.55172414
  2.86206897  3.17241379  3.48275862  3.79310345  4.10344828  4.4137931
  4.72413793  5.03448276  5.34482759  5.65517241  5.96551724  6.27586207
  6.5862069   6.89655172  7.20689655  7.51724138  7.82758621  8.13793103
  8.44827586  8.75862069  9.06896552  9.37931034  9.68965517 10.        ]

In [93]:
d=np.arange(10,21)
d

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20])

In [96]:
b=np.array([[[[3.0,3,2,3,3],[3,4,5,6,5]]]])
b.ndim

4

In [101]:
v=np.array([[[[3.0,3,2,3,3],[3,4,5,6,5]]]],ndmin=7,dtype='int64')
v

array([[[[[[[3, 3, 2, 3, 3],
            [3, 4, 5, 6, 5]]]]]]], dtype=int64)

In [102]:
v.ndim

7

In [109]:
k=np.array([[[[[[[3, 3, 2, 3, 3],
            [3, 4, 5, 6, 5]]]]]]])
k.reshape(10)
k.reshape(2,5)

array([[3, 3, 2, 3, 3],
       [3, 4, 5, 6, 5]])

In [123]:
arrr=np.array([1,4,3,2,5,6,4,5,8])

In [126]:
np.sort(arrr,axis=None)

array([1, 2, 3, 4, 4, 5, 5, 6, 8])

In [128]:
a=np.array([1,4,3,2,5,6,4,5,8])
b=np.array([5,4,8,8,5,7,4,5,8])
np.concatenate((a,b),axis=0)

array([1, 4, 3, 2, 5, 6, 4, 5, 8, 5, 4, 8, 8, 5, 7, 4, 5, 8])

In [132]:
np.concatenate([[a,b]],axis=1)

array([[1, 4, 3, 2, 5, 6, 4, 5, 8],
       [5, 4, 8, 8, 5, 7, 4, 5, 8]])

In [135]:
a=np.array([1, 4, 3, 2, 5, 6, 4, 5, 8, 5, 4, 8, 8, 5, 7, 4, 5, 8])

In [137]:
a2=a[np.newaxis,1:5]
a2

array([[4, 3, 2, 5]])

In [139]:
a1=a[1:5,np.newaxis]
a1

array([[4],
       [3],
       [2],
       [5]])

In [140]:
b=np.expand_dims(a,axis=0)
print(b.shape)
print(b.ndim)
print(b)

(1, 18)
2
[[1 4 3 2 5 6 4 5 8 5 4 8 8 5 7 4 5 8]]

In [143]:
a=np.array([[1,2,3,4],[5,6,7,8],[9,20,11,12]])
a[a>=5]

array([ 5,  6,  7,  8,  9, 20, 11, 12])

In [145]:
lst=[1,2,3,4]
[lst<=[10]]

[True]

In [147]:
idv_by_two=a[a%2==0]
idv_by_two

array([ 2,  4,  6,  8, 20, 12])

In [149]:
a[(a>5)&(a<12)&(a!=10)]

array([ 6,  7,  8,  9, 11])

In [150]:
a

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 20, 11, 12]])

In [151]:
list_of_co=zip(a[2],a[1])
for coord in list_of_co:
    print(coord)

(9, 5)
(20, 6)
(11, 7)
(12, 8)

In [152]:
not_there=np.nonzero(a)
print(not_there)

(array([0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], dtype=int64), array([0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3], dtype=int64))